var MongoClient = require('mongodb').MongoClient;
var url = 'mongodb://120.25.75.23:27017/data';
t = [
    {"名称":"蜜蜡珠链","货号":"L1712-212001M","重量（g）":"19.8","规格（mm）":"7","粒数":"110","克价（元）":"120/g","售价":"2876",},
    {"名称":"蜜蜡珠链","货号":"L1712-312002M","重量（g）":"16.9","规格（mm）":"6","粒数":"123","克价（元）":"120/g","售价":"2628",},
    {"名称":"蜜蜡珠链","货号":"L1712-312003M","重量（g）":"15.9","规格（mm）":"6","粒数":"127","克价（元）":"120/g","售价":"2400",},
    {"名称":"蜜蜡珠链","货号":"L1712-215004M","重量（g）":"20.5","规格（mm）":"13.5","粒数":"15","克价（元）":"180/g","售价":"3890",},
    {"名称":"蜜蜡珠链","货号":"L1712-215005M","重量（g）":"20.5","规格（mm）":"13.5","粒数":"15","克价（元）":"180/g","售价":"3890",},
    {"名称":"蜜蜡珠链","货号":"L1712-222006M","重量（g）":"37.1","规格（mm）":"8","粒数":"118","克价（元）":"150/g","售价":"5565",},
    {"名称":"蜜蜡珠链","货号":"L1712-222007M","重量（g）":"37.4","规格（mm）":"8","粒数":"118","克价（元）":"150/g","售价":"5610","备注":"改编“游鱼”余34粒"},
    {},

];

MongoClient.connect(url, function (err, d) {
    if (err) throw err;
    console.log('数据库已创建!');
    db = d.db('data');
    for (item of t) {
        if(item.扫描码){
        item.条码号= item.扫描码
        item._id= item.扫描码
        delete item.扫描码}
        else {

            item.条码号= item.证书号
            item._id= item.证书号
        }
        if (item.证书号&&item.条码号&&item.名称)
        db.collection('sp').insertOne( {
                    ...item,
                    状态: '在库',
            '材质':'蜜蜡',
            '类别':'珠链'
            });
        else{
            console.log(item)
        }
    }
});
